# ЗАПУСК БОТА
START = (
    'Приветственный текст'
)
START_BUTTON_1 = 'Основная информация'
START_BUTTON_2 = 'Викторины'

BACK_BUTTON = '◀ назад'  # КНОПКА ДЛЯ ВОЗВРАЩЕНИЯ НАЗАД

# ВЫБОР МУЗЕЯ
SELECT_MUSEUM = (
    'Выберите музей'
)
MUSEUM_BUTTON_1 = 'Музей 1'
MUSEUM_BUTTON_2 = 'Музей 2'
MUSEUM_BUTTON_3 = 'Музей 3'
MUSEUM_BUTTON_4 = 'Музей 4'
MUSEUM_BUTTON_5 = 'Музей 5'

MUSEUMS = {
    1: {
        'photo_path': 'images/image.jpg',
        'caption': (
            'Информация о музее'
        )
    },
    2: {
        'photo_path': 'images/image.jpg',
        'caption': (
            'Информация о музее'
        )
    },
    3: {
        'photo_path': 'images/image.jpg',
        'caption': (
            'Информация о музее'
        )
    },
    4: {
        'photo_path': 'images/image.jpg',
        'caption': (
            'Информация о музее'
        )
    },
    5: {
        'photo_path': 'images/image.jpg',
        'caption': (
            'Информация о музее'
        )
    },
}

# КНОПКА С ССЫЛКОЙ НА ОПЕРАТОРА
OPERATOR_BUTTON = 'Помощь оператора'
OPERATOR_LINK = 'https://kaattyyyy.t.me'

# ВЫБОР УРОВНЯ СЛОЖНОСТИ
SELECT_LEVEL = 'Выберите сложность:'
LEVEL_1 = '1 уровень'
LEVEL_2 = '2 уровень'
LEVEL_3 = '3 уровень'

# ВИКТОРИНЫ
QUIZZES = {
    'level_1': {
        1: {
            'text': (
                'Текст вопроса 1'
            ),
            'right_answer_id': 1,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
                'Вариант 5',
            ]
        },
        2: {
            'text': (
                'Текст вопроса 2'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        3: {
            'text': (
                'Текст вопроса 3'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        4: {
            'text': (
                'Текст вопроса 4'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        5: {
            'text': (
                'Текст вопроса 5'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        6: {
            'text': (
                'Текст вопроса 6'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        7: {
            'text': (
                'Текст вопроса 7'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        8: {
            'text': (
                'Текст вопроса 8'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        9: {
            'text': (
                'Текст вопроса 9'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        10: {
            'text': (
                'Текст вопроса 10'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
    },
    'level_2': {
        1: {
            'text': (
                'Текст вопроса 1'
            ),
            'right_answer_id': 1,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
                'Вариант 5',
            ]
        },
        2: {
            'text': (
                'Текст вопроса 2'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        3: {
            'text': (
                'Текст вопроса 3'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        4: {
            'text': (
                'Текст вопроса 4'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        5: {
            'text': (
                'Текст вопроса 5'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        6: {
            'text': (
                'Текст вопроса 6'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        7: {
            'text': (
                'Текст вопроса 7'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        8: {
            'text': (
                'Текст вопроса 8'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        9: {
            'text': (
                'Текст вопроса 9'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        10: {
            'text': (
                'Текст вопроса 10'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        11: {
            'text': (
                'Текст вопроса 11'
            ),
            'right_answer_id': 1,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
                'Вариант 5',
            ]
        },
        12: {
            'text': (
                'Текст вопроса 12'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        13: {
            'text': (
                'Текст вопроса 13'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        14: {
            'text': (
                'Текст вопроса 14'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        15: {
            'text': (
                'Текст вопроса 15'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        16: {
            'text': (
                'Текст вопроса 16'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        17: {
            'text': (
                'Текст вопроса 17'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        18: {
            'text': (
                'Текст вопроса 18'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        19: {
            'text': (
                'Текст вопроса 19'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        20: {
            'text': (
                'Текст вопроса 20'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
    },
    'level_3': {
        1: {
            'text': (
                'Текст вопроса 1'
            ),
            'right_answer_id': 1,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
                'Вариант 5',
            ]
        },
        2: {
            'text': (
                'Текст вопроса 2'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        3: {
            'text': (
                'Текст вопроса 3'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        4: {
            'text': (
                'Текст вопроса 4'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        5: {
            'text': (
                'Текст вопроса 5'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        6: {
            'text': (
                'Текст вопроса 6'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        7: {
            'text': (
                'Текст вопроса 7'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        8: {
            'text': (
                'Текст вопроса 8'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        9: {
            'text': (
                'Текст вопроса 9'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        10: {
            'text': (
                'Текст вопроса 10'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        11: {
            'text': (
                'Текст вопроса 11'
            ),
            'right_answer_id': 1,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
                'Вариант 5',
            ]
        },
        12: {
            'text': (
                'Текст вопроса 12'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        13: {
            'text': (
                'Текст вопроса 13'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        14: {
            'text': (
                'Текст вопроса 14'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        15: {
            'text': (
                'Текст вопроса 15'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        16: {
            'text': (
                'Текст вопроса 16'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        17: {
            'text': (
                'Текст вопроса 17'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        18: {
            'text': (
                'Текст вопроса 18'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        19: {
            'text': (
                'Текст вопроса 19'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        20: {
            'text': (
                'Текст вопроса 20'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        21: {
            'text': (
                'Текст вопроса 21'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        22: {
            'text': (
                'Текст вопроса 22'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        23: {
            'text': (
                'Текст вопроса 23'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        24: {
            'text': (
                'Текст вопроса 24'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
        25: {
            'text': (
                'Текст вопроса 25'
            ),
            'right_answer_id': 2,
            'variants_answer': [
                'Вариант 1',
                'Вариант 2',
                'Вариант 3',
                'Вариант 4',
            ]
        },
    },
}

# РЕЗУЛЬТАТ ВИКТОРИНЫ
RESULT_QUIZ_40 = 'Ваш результат не очень: {result}%'
RESULT_QUIZ_60 = 'Ваш результат хорошо: {result}%'
RESULT_QUIZ_80 = 'Ваш результат отлично: {result}%'
